ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV153/ESP32_WordClockV153.ino
    case '{':  
      if (Mem.UseRotary==3 || Mem.UseRotary==4)
       {
         StartIRLearning();                                                                   // Initializes learning mode,Resets all button data, Prompts for first button
         snprintf(sptext, sizeof(sptext), "Learning IR finished");
       }
      else snprintf(sptext, sizeof(sptext), "IR remote is OFF (Turn it on with H03 or H04 )\nOr no IR remote is installed");
      break;

    case '}':                                                                                 // *** Empty ***
      if(len == 1) 
       {
       // snprintf(sptext, sizeof(sptext), "--- %s ---", Mem.ByteFutureX ? "OFF" : "ON");
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

    case '~':
      if(len == 1) 
       {
        if (Mem.RandomDisplay > 0) Mem.RandomDisplay = 0;
        else                       Mem.RandomDisplay = 1;
       }
      if(len == 2) 
       {
        byte ff = (byte)InputString.substring(1, 2).toInt();
        if (ff < 3) Mem.RandomDisplay = ff;
       }
      Mem.DisplayChoice = DEFAULTCOLOUR;
      snprintf(sptext, sizeof(sptext), "Random display is %s", Mem.RandomDisplay==1 ? "ON/min" : Mem.RandomDisplay==2 ? "ON/hour" : "OFF");
      break;

    case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        snprintf(sptext, sizeof(sptext), "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter + ****");
      break;
      
    case '_':                                                                                 // Store in flash
      if(len > 1 && len < 4) 
       {
        byte ff = (byte)InputString.substring(1, 3).toInt();
        snprintf(sptext, sizeof(sptext), "No use: %d", ff);
        Tekstprintln(sptext);
       }
      break;

    case '=':                                                                                 // Print permanent Mem memory
      if(len == 1)  PrintMem(); 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter = ****");
      break;     

    case '0': 
    case '1': 
    case '2':                                                             // Time entry compatibility mode
      if(len == 6)                                                        // The first digit of InputString is 0, 1 or 2
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 0, 2, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 2, 4, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 4, 6, 0, 59);
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       }   
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
  }
  Tekstprintln(sptext);
  StoreStructInFlashMemory();                                                                 // Update EEPROM
 }
InputString = "";
lastminute = 99;                                                                              // Force a minute update
}
//--------------------------------------------                                                //
// COMMON Print Display choice
// Default print the text
//--------------------------------------------
void PrintDisplayChoice() {PrintDisplayChoice(true);}
void PrintDisplayChoice(bool PrintIt)
{
 byte dp = Mem.DisplayChoice;
 if (dp>9) dp=9;
 snprintf(sptext, sizeof(sptext),"Display choice: %s",
        dp==0?"Yellow+":dp==1?"Hourly":dp==2?"White"  :dp==3?"All Own":
        dp==4?"Own+"   :dp==5?"Wheel" :dp==6?"Digital":dp==7?"Hourly+":
        dp==8?"Rainbow":      "NOP");        
 if (PrintIt) Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print time input method
// Rotary, Membrane or IR-remote
//--------------------------------------------
void PrintTimeInputMethod(byte Im)
{
  char Method[20];
  switch(Im)
  {
    case 0: strcpy(Method, "None");            break;
    case 1: strcpy(Method, "Rotary");          break;
    case 2: strcpy(Method, "Membrane");        break;
    case 3: strcpy(Method, "Large IR-remote"); break;
    case 4: strcpy(Method, "Tiny Ir-remote");  break;     
   default: strcpy(Method, "Error");
  }
  snprintf(sptext, sizeof(sptext), "Time inputMethod: %s", Method);
  Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print permanent Mem memory
//--------------------------------------------
void PrintMem(void)
{
 PrintLine(35); 
 PrintHeaps(); 
 PrintAllMappings();                                                                          // Print the IR remote keys 
 PrintDisplayChoice();
 Tekstprintlnf(" TurnOffLEDsAtHH: %d",Mem.TurnOffLEDsAtHH);                 
 Tekstprintlnf("  TurnOnLEDsAtHH: %d",Mem.TurnOnLEDsAtHH);                  
 Tekstprintlnf("  LanguageChoice: %d",Mem.LanguageChoice);                  
 Tekstprintlnf("    LightReducer: %d",Mem.LightReducer);                    
 Tekstprintlnf(" LowerBrightness: %d",Mem.LowerBrightness);                 
 Tekstprintlnf(" UpperBrightness: %d",Mem.UpperBrightness);                 
 for (int i=0;i<12;i++) { Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 for (int i=12;i<24;i++){ Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 Tekstprintlnf("   DisplayChoice: %d",Mem.DisplayChoice);                                                                                      
 Tekstprintlnf("           BLEOn: %s",Mem.BLEOn ? "ON" : "OFF");            
 Tekstprintlnf("           NTPOn: %s",Mem.NTPOn ? "ON" : "OFF");            
 Tekstprintlnf("          WIFIOn: %s",Mem.WIFIOn ? "ON" : "OFF");           
 Tekstprintlnf("     StatusLEDOn: %s",Mem.StatusLEDOn ? "ON" : "OFF");      
 Tekstprintlnf("    MCUrestarted: %d",Mem.MCUrestarted );                   
 Tekstprintlnf("    LoopRebooted: %d",Mem.LoopRebooted );                   
 Tekstprintlnf("     ByteFuture1: %d",Mem.ByteFuture1 );                    
 Tekstprintlnf(" Time per minute: %s",Mem.TimeMinute == 1 ? "ON" : "OFF"); 
 Tekstprintlnf("   Time per hour: %s",Mem.TimeMinute == 2 ? "ON" : "OFF");          
 Tekstprintlnf("         DCF77On: %s",Mem.DCF77On  ? "ON" : "OFF");         
 Tekstprintlnf("       UseRotary: %d",Mem.UseRotary);                       
 PrintTimeInputMethod(Mem.UseRotary);
 Tekstprintlnf("       UseDS3231: %s",Mem.UseDS3231 ? "ON" : "OFF");        
 Tekstprintlnf("       LED strip: %s", Mem.LEDstrip?"WS2812":"SK6812" );    
 Tekstprintlnf("      FiboChrono: %s",Mem.FiboChrono ? "FIBO" : "CHRONO");  
 Tekstprintlnf("          NoExUl: %s", Mem.NoExUl ? "ON" : "OFF");          
 byte wc = Mem.WIFIcredentials; 
 Tekstprintlnf(" WIFIcredentials: %s", wc==0? "Not SET" : wc==1? "SET" : wc==2? "SET&OK": 
                                       wc==3? "in AP not SET":"Unknown code");   
 Tekstprintlnf("      IntFuture2: %d",Mem.IntFuture2 );                     
 Tekstprintlnf("      IntFuture3: %d",Mem.IntFuture3 );                     
 Tekstprintlnf("      HET IS WAS: %s", Mem.HetIsWasOff ? "OFF" : "ON");     
 Tekstprintlnf("       EDSOFT is: %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");    
 Tekstprintlnf("   RandomDisplay: %s", Mem.RandomDisplay? "ON" : "OFF");    
 Tekstprintlnf("WIFInoConnection: %d", Mem.WIFInoConnection);               
 Tekstprintlnf("UseBLELongString: %s",Mem.UseBLELongString?"ON":"OFF");     
 Tekstprintlnf("     Font colour: 0X%08" PRIX32, Mem.OwnColour);            
 Tekstprintlnf("    DimmedLetter: 0X%08" PRIX32,Mem.DimmedLetter);          
 Tekstprintlnf("      BackGround: 0X%08" PRIX32,Mem.BackGround);            
 Tekstprintlnf("            SSID: %s",Mem.SSID);                            
 // Tekstprintlnf("BackGround: %s",Mem.Password);                           
 Tekstprintlnf("BLEbroadcastName: %s",Mem.BLEbroadcastName);                
 Tekstprintlnf("        Timezone: %s",Mem.Timezone);                        
 Tekstprintlnf("        Checksum: %d",Mem.Checksum);                        
 sptext[0]=0;                                                                                 // Suppress a second print of sptext
}

//--------------------------------------------                                                //
// COMMON Print memory space
//--------------------------------------------
void StoredStartHeaps(){ StoredStartHeaps(false); }
void StoredStartHeaps(bool Store)
{
 static uint32_t a,b,c,d,e,f;
 if(Store)
   {
    a = ESP.getFreeHeap();
    b = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
    c = esp_get_minimum_free_heap_size();
    d = heap_caps_get_free_size(MALLOC_CAP_8BIT);
    e = heap_caps_get_free_size(MALLOC_CAP_DMA);
    f = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
   }
  else
  {
  Tekstprintln("Heaps before allocation of the ringbuffer");
  Tekstprintlnf("         Free heap: %7.1f Kbytes", a / (1024.0  ));
  Tekstprintlnf("     Largest block: %7.1f Kbytes", b / (1024.0  ));
  Tekstprintlnf("     Min free heap: %7.1f Kbytes", c / (1024.0  ));
  Tekstprintlnf("8-bit capable heap: %7.1f Kbytes", d / (1024.0  ));
  Tekstprintlnf("  DMA capable heap: %7.1f Kbytes", e / 1024.0);
  Tekstprintlnf(" SPRAM/SPIRAM heap: %7.1f Kbytes", f / (1024.0  ));
  PrintLine(35);
  }

